Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/

/*******************************************************************************
* File Name    : r_dmaca_rx.c
* Description  : Functions for DMACA driver
*******************************************************************************/
/*******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 30.06.2014 1.00    Initial release
*         : 27.08.2014 1.01    Not change program due to updating application note only.
*         : 30.01.2015 1.02    Added RX71M.
*         : 13.04.2015 1.03    Added RX231 and RX230.
*         : 30.09.2016 1.04    Added transfer_count and block_size to "case DMACA_CMD_STATUS_GET"
*         :                    of R_DMACA_Control().
*         : 31.07.2017 1.05    Supported RX65N-2MB.
*                              Fixed to correspond to Renesas coding rule.
*         : 28.09.2018 1.10    Supported RX66T.
*                              Add WAIT_LOOP comments.
*                              Added comments and brackets according to Renesas GSCE coding standard 5.0.
*         : 01.02.2019 1.20    Supported RX72T, RX65N-64pin.
*                              Added comments according to Renesas GSCE coding standard 5.0.
*         : 20.05.2019 2.00    Added support for GNUC and ICCRX.
*         : 28.06.2019 2.10    Supported RX23W.
*         : 15.08.2019 2.20    Supported RX72M.
*                              Fixed warnings in IAR.
*         : 30.12.2019 2.30    Modified comment of API function to Doxygen style.
*                              Fixed to comply with GSCE Coding Standards Rev.6.00.
*         : 31.03.2021 2.60    Supported RX671.
*         : 15.08.2022 3.10    Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*         : 29.05.2023 3.20    Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*         : 15.03.2025 3.41    Updated disclaimer.
*******************************************************************************/

/*******************************************************************************
Includes   <System Includes>, "Project Includes"
*******************************************************************************/
/* Definitions for DMACA support */
#if defined(__CCRX__) || defined(__ICCRX__)
/* Intrinsic functions provided by compiler. */
#include <machine.h>
#elif defined(__GNUC__)
/* No header file for intrinsic functions. */
#endif /* defined(__CCRX__), defined(__GNUC__), defined(__ICCRX__) */
#include "r_dmaca_rx_if.h"
#include "./src/r_dmaca_rx_private.h"


/*******************************************************************************
Macro definitions
*******************************************************************************/

/*******************************************************************************
Typedef definitions
*******************************************************************************/


/*******************************************************************************
Private variables and functions
*******************************************************************************/
static bool r_dmaca_set_transfer_data (uint8_t channel, dmaca_transfer_data_cfg_t *p_cfg);
static dmaca_chk_locking_sw_t r_dmaca_check_locking_sw (void);

/*******************************************************************************
Exported global variables (to be accessed by other files)
*******************************************************************************/
/* This array holds callback functions. */
void *g_pdmaci_handlers[DMACA_NUM_CHANNELS];
uint8_t g_locking_sw[DMACA_NUM_CHANNELS];


/***********************************************************************************************************************
* Function Name: R_DMACA_Open
********************************************************************************************************************//**
* @brief This function is run after calling R_DMACA_Init() when using the APIs of the DMACA FIT module.
* @param[in] channel DMAC channel number.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_BUSY Resource has been locked by other process.
* @details Locks*1 the DMAC channel specified by the argument channel, then makes initial settings.
* Releases the DMAC from the module stop state, then activates the DMAC. Also, initializes the activation
* source selection register for the specified DMAC channel.\n
* Note: 1. The DMACA FIT module uses the r_bsp default lock function. As a result, the specified DMAC
* channel is in the locked state after a successful end.
* @note
* None.
*/
dmaca_return_t R_DMACA_Open(uint8_t channel)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)
    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    /* ---- Lock DMACA hardware. ---- */
    if (false == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_DMAC0 + channel)))
    {
        /* Lock has already been acquired by another task. Need to try again later. */
        return DMACA_ERR_BUSY;
    }

    /* ---- Lock the DMACA channel. ---- */
    g_locking_sw[channel] = 1;

    /* Clear a Activation Request Select Register. */
    ICU_DMRSR(channel)  = 0x00;

    if (0x00 == ICU_DMRSR(channel))
    {
        /* do nothing */
    }

    /* Cancel module stop for DMAC and DTC. */
    r_dmaca_module_enable();

    /* Enable the DMAC activation. */
    DMACA_DMAST = DMACA_ACTIVE_ENABLE;

    /* Check DMAC activating status */
    if (DMACA_ACTIVE_ENABLE == DMACA_DMAST)
    {
        /* do nothing */
    }

