Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
            /* Check transfer of the corresponding channel */
            if (DMACA_TRANSFER_ENABLE == DMACA_DMCNT(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_DISABLE: /* Disable DMA transfer of the specified channel. */
        {
            /* Disable transfer for the corresponding channel */
            DMACA_DMCNT(channel) = DMACA_TRANSFER_DISABLE;

            /* Check transfer of the corresponding channel */
            if (DMACA_TRANSFER_DISABLE == DMACA_DMCNT(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_ALL_ENABLE: /* Enable DMAC activation. */
        {
            /* Enable DMAC */
            DMACA_DMAST = DMACA_ACTIVE_ENABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_ENABLE == DMACA_DMAST)
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_ALL_DISABLE: /* Disable DMAC activation. */
        {
            /* Disable DMAC */
            DMACA_DMAST = DMACA_ACTIVE_DISABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_DISABLE == DMACA_DMAST)
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_WITH_AUTO_CLR_REQ: /* DMA transfer by Software using DMREQ.SWREQ bit Auto Clear mode */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* Check a DMREQ.CLRS bit. */
            if (0 == (DMACA_DMREQ(channel) & DMACA_CLRS_BIT_MASK))
            {
                /* Check a DMREQ.SWREQ bit. */
                if (0 !=  (DMACA_DMREQ(channel) & DMACA_SWREQ_BIT_MASK))
                {
                    return DMACA_ERR_SOFTWARE_REQUESTED;
                }
            }

            /* DMA transfer by software is requested and request flag is cleared automatically. */
            DMACA_DMREQ(channel) = DMACA_SOFT_REQ_WITH_AUTO_CLR_REQ;

            /* Check DMREQ. */
            if (DMACA_SOFT_REQ_WITH_AUTO_CLR_REQ == DMACA_DMREQ(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_NOT_CLR_REQ: /* DMA transfer by Software */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* DMA transfer by software is requested and request flag is not cleared. */
            DMACA_DMREQ(channel) = DMACA_SOFT_REQ_NOT_CLR_REQ;

            /* Check DMREQ. */
            if (DMACA_SOFT_REQ_NOT_CLR_REQ == DMACA_DMREQ(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_CLR: /* Clear DMREQ.SWREQ bit. */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* Clear DMREQ.SWREQ bit. */
            DMACA_DMREQ(channel) &= (~DMACA_SWREQ_BIT_MASK);

            /* Check DMREQ. */
            if (0x00 == (DMACA_DMREQ(channel) & DMACA_SWREQ_BIT_MASK))
            {
                /* do nothing */
            }
            break;
        }

        case DMACA_CMD_STATUS_GET:
        {
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)
            /* Check argument. */
            if ((uint32_t)NULL == (uint32_t)p_stat)
            {
                return DMACA_ERR_NULL_PTR;
            }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

            /* Get DMAC status register*/
            dmaca_interrupt_status = DMACA_DMSTS(channel);

            /* Get DMAC software Start register*/
            dmaca_soft_req_status = DMACA_DMREQ(channel);

            if (0 == (dmaca_interrupt_status & DMACA_ACT_BIT_MASK)) /* Get the current status of DMACA. */
            {
                /* DMACA operation is suspended. */
                p_stat->act_stat = false;
            }
            else
            {
                /* DMACA is operating. */
                p_stat->act_stat = true;
            }

            if (0 == (dmaca_interrupt_status & DMACA_DTIF_BIT_MASK)) /* Get the transfer end interrupt flag. */
            {
                /* A transfer end interrupt has not been generated. */
                p_stat->dtif_stat = false;
            }
            else
            {
                /* A transfer end interrupt has been generated. */
                p_stat->dtif_stat = true;
            }

            if (0 == (dmaca_interrupt_status & DMACA_ESIF_BIT_MASK)) /* Get the escape end interrupt flag. */
            {
                /* A transfer escape end interrupt has not been generated. */
                p_stat->esif_stat = false;
            }
            else
            {
                /* A transfer escape end interrupt has been generated. */
                p_stat->esif_stat = true;
            }

            if (0 == (dmaca_soft_req_status & DMACA_SWREQ_BIT_MASK)) /* Get the SWREQ flag. */
            {
                /* A software transfer is not requested. */
                p_stat->soft_req_stat = false;
            }
            else
            {
                /* A software transfer is requested. */
                p_stat->soft_req_stat = true;
            }

            /* Get DMAC transfer mode from the corresponding channel */
            dmaca_dmtmd = DMACA_DMTMD(channel);

            if ((DMACA_TRANSFER_MODE_REPEAT & dmaca_dmtmd) ||
                (DMACA_TRANSFER_MODE_BLOCK & dmaca_dmtmd))
            {
                /* Get transfer count from the corresponding channel */
                p_stat->transfer_count = (uint32_t)DMACA_DMCRB(channel);
            }
            else /* DMACA_TRANSFER_MODE_NORMAL */
            {
                /* Get transfer count from the corresponding channel */
                p_stat->transfer_count = (DMACA_INVALID_LOWER_BIT_MASK & DMACA_DMCRA(channel));
            }
            break;
        }
        case DMACA_CMD_ESIF_STATUS_CLR:
        {
            /* Clears Transfer Escape End Interrupt Flag. */
            DMACA_DMSTS(channel) = ~((uint8_t)DMACA_ESIF_BIT_MASK);

            /* Check DMAC status register */
            if (0x00 == DMACA_DMSTS(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_DTIF_STATUS_CLR:
        {
            /* Clears Transfer Interrupt Flag. */
            DMACA_DMSTS(channel) = ~((uint8_t)DMACA_DTIF_BIT_MASK);

            /* Check DMAC status register */
            if (0x00 == DMACA_DMSTS(channel))
            {
                /* do nothing */
            }
            break;
        }
        default:
        {
            return DMACA_ERR_INVALID_COMMAND;
            break;
        }
    }

