Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Control
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Init
********************************************************************************************************************//**
* @brief This function is used to initialize the DMAC's internal information.
* @details Initializes the usage status of each DMA channel (internal information). Also, cancels the registered
* callback functions for all DMAC transfer end interrupts/transfer escape end interrupts (DMAC0I, DMAC1I, DMAC2I,
* DMAC3I, and DMAC74I). If DMAC transfer end interrupts/transfer escape end interrupts will be used, run the
* R_DMACA_Init() function beforehand, and then use the R_DMACA_Int_Callback() function (described below) to register
* the callback functions.
* @note When using the DMACA driver, run the R_DMACA_Init() function first. It is recommended to run at hardware setup
* operation.
*/
void R_DMACA_Init(void)
{
    uint32_t i;

    /* Initialize a callback for DMAC interrupts */
    /* WAIT_LOOP */
    for (i = 0; i < DMACA_NUM_CHANNELS; i++)
    {
        /* Initialize callback functions as FIT_NO_FUNC */
        g_pdmaci_handlers[i] = (void *)FIT_NO_FUNC;
        g_locking_sw[i] = 0;
    }
}
/**************************************************************************
* End of function R_DMACA_Init
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Int_Callback
********************************************************************************************************************//**
* @brief This function is used to register the callback function for the DMAC transfer end interrupt/transfer escape end
*  interrupt.
* @param[in] channel DMAC channel number.
* @param[in] p_callback Pointer to function that is called when a DMAC transfer end interrupt/transfer escape end
* interrupt occurs.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_INVALID_HANDLER_ADDR Invalid function address is set.
* @details Registers the callback function for the DMAC transfer end interrupt/transfer escape end interrupt of the
* specified channel. The registration of an already-registered callback function is canceled if FIT_NO_FUNC or NULL
* is passed as the callback argument. Also, the registration of an already-registered callback function is canceled
* if DMACA_ERR_INVALID_HANDLER_ADDR is returned.\n
* Note: The callback function arguments and return values should be of void type
* @note None
*/
dmaca_return_t R_DMACA_Int_Callback(uint8_t channel,  void * p_callback)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }

    /* Check for valid address. */
    if (((uint32_t)NULL == (uint32_t)p_callback) || ((uint32_t)FIT_NO_FUNC == (uint32_t)p_callback))
    {
        /* Previously registered callback is unregistered */
        g_pdmaci_handlers[channel] = (void *)FIT_NO_FUNC;
        return DMACA_ERR_INVALID_HANDLER_ADDR;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    g_pdmaci_handlers[channel] = p_callback;
    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Int_Callback
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Int_Enable
********************************************************************************************************************//**
* @brief This function is used to enable DMAC transfer end interrupts/transfer escape end interrupts.
* @param[in] channel DMAC channel number.
* @param[in] priority DMAC transfer end interrupt/transfer escape end interrupt priority level.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @details Enables the DMAC transfer end interrupt/transfer escape end interrupt for the specified channel.
* @note None
*/
dmaca_return_t R_DMACA_Int_Enable(uint8_t channel, uint8_t priority)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    /* Set the DMACmI priority level. */
    /* Set the DMACmI interrupt Enable bit. */
    if (r_dmaca_int_enable(channel, priority) != DMACA_SUCCESS)
    {
        return DMACA_ERR_INVALID_CH;
    }

    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Int_Enable
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Int_Disable
********************************************************************************************************************//**
* @brief This function is used to disable the DMAC transfer end interrupt/transfer escape end interrupt.
* @param[in] channel DMAC channel number.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @details Disables the DMAC transfer end interrupt/transfer escape end interrupt for the specified channel.
* @note None
*/
dmaca_return_t R_DMACA_Int_Disable(uint8_t channel)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

